app/Controllers/AsignacionEquipo/AsignacionEquipoController.php

    public function listarAsignaciones()
    {
        $dato = [
            'asignaciones' => $this->asignacionModel->obtenerAsignaciones(),
            'equipos'      => $this->equipoModel->findAll(),
---
SELECT *
FROM `equipo`

    public function crearAsignacion()
    {
        $idEquipo = $this->request->getPost('id_equipo');
        $idUnidad = $this->request->getPost('id_unidad_organica');


        $dato = [
            'id_equipo'          => $this->request->getPost('id_equipo'),
            'id_unidad_organica' => $this->request->getPost('id_unidad_organica'),
            'fecha_asignacion'   => $this->request->getPost('fecha_asignacion'),
            'estado_asignacion'  => $this->request->getPost('estado_asignacion'),
            'created_by'         => session()->get('id_usuario'),
        ];

        // Evitar error de validación por fecha
        $this->asignacionModel->skipValidation(true)->insert($dato);

        // Actualizar unidad_actual en tabla equipos
        $this->equipoModel->update($idEquipo, [
            'unidad_actual' => $idUnidad
        ]);
---
SELECT *
FROM `unidad_organica`
UPDATE `equipo` SET `unidad_actual` = '2'
WHERE `equipo`.`id_equipo` IN ('66')