app/Controllers/AtributoEquipoController.php

    public function listarCaract()
    {

        $datos['atributo_equipo'] = $this->atributoEquipo->obtenerAtributoTipo();
        $datos['tipo_equipo'] = $this->tipoEquipo->findall();
---
SELECT *
FROM `tipo_equipo`