app/Controllers/Equipos.php

    private function cargarListasSelect(): array
    {
        $db = \Config\Database::connect();

        return [
            'tipos'    => $db->table('tipo_equipo')->select('id_tipo, nombre')->get()->getResultArray(),
            'estados'  => $db->table('estadoequipo')->select('id_estado, estado')->get()->getResultArray(),
            'modelos'  => $db->table('modelo')->select('id_modelo, modelo')->get()->getResultArray(),
            'unidades' => $db->table('unidad_organica')->select('id_unidadOrganica, nombre')->get()->getResultArray(),
        ];
---
SELECT `id_tipo`, `nombre`
FROM `tipo_equipo`
SELECT `id_estado`, `estado`
FROM `estadoequipo`
SELECT `id_modelo`, `modelo`
FROM `modelo`
SELECT `id_unidadOrganica`, `nombre`
FROM `unidad_organica`

    public function guardar()
    {
        $modelo = new EquipoModel();
        $tipoModelo = new TipoEquipoModelo();
        $modeloModelo = new ModeloEquipo();

        $idTipo = $this->request->getPost('id_tipoEquipo');
        $idModelo = $this->request->getPost('id_modeloEquipo');
        //si se elige nuevo, insertamos en tipo_equipo

        if ($idTipo === 'nuevo') {
            $nuevoTipo = $this->request->getPost('nuevo_tipo');
            $idTipo = $tipoModelo->insert(['nombre' => $nuevoTipo]);
        }

        if ($idModelo === 'nuevo') {
            $nuevoModelo = $this->request->getPost('nuevo_modelo');
            $idModelo = $modeloModelo->insert(['modelo' => $nuevoModelo]);
        }

        $data = [
            'id_tipoEquipo'           => $idTipo,
            'id_estadoEquipo'         => $this->request->getPost('id_estadoEquipo'),
            'id_modeloEquipo'         => $this->request->getPost('id_modeloEquipo'),
            'id_unidadOrganicaEquipo' => $this->request->getPost('id_unidadOrganicaEquipo'),
        ];

        $modelo->insert($data);
---
INSERT INTO `equipo` (`id_tipoEquipo`, `id_estadoEquipo`, `id_modeloEquipo`, `id_unidadOrganicaEquipo`) VALUES ('1', '2', '1', '2')