app/Controllers/Equipo.php

    public function index()
    {
        $equipoModel = new EquipoModel();
        $data['equipo'] = $equipoModel->findAll(); //Obtiene los registros
---
SELECT *
FROM `equipo`