app/Controllers/GestionEquipoController.php

SELECT *
FROM `tipo_equipo`
---
    public function index()
    {
        $data = [
            'titulo'  => 'Lista de Equipos',
            'equipos' => $this->equipoModel->obtenerEquipos(),
            'tipos'   => $this->tipoModel->findAll(),
            'marcas'  => $this->marcaModel->findAll(),
            'modelos' => $this->modeloModel->findAll(),
            'estados' => $this->estadoModel->findAll(),
        ];

INSERT INTO `equipo` (`codig_patrimonial`, `num_serie`, `id_tipo_equipo`, `id_modelo_equipo`, `id_estado_equipo`) VALUES ('COM-UNSM-0012025', 'efewcwc', '19', '27', '1')
---
            //
        ];

        $this->equipoModel->insert($data);