app/Controllers/ValatriEquipoController.php

    public function agregarCaract()
    {
        $atributoModelo = new AtributoEquipoModel();
        $valorModelo = new ValatriequipoModel();

        $idEquipo = $this->request->getPost('id_equipo');
        $idAtributo = $this->request->getPost('id_atributo_equipo');
        $valor = $this->request->getPost('valor_atributo');

        //Validacion basica
        if (empty($idEquipo) || empty($idAtributo) || empty($valor)) {
            return redirect()->back()->with('error', 'Todos los campos son obligatorios');
        }

        // validar el duplicado por equipo + atributo + valor
        $existe = $valorModelo->where('id_equipo',$idEquipo)
                              ->where('id_atributo_equipo',$idAtributo)
                              ->first();

        if ($existe) {
            $valorModelo->update($existe['id_valor_atributo'],['valor_atributo' => $valor]);
            return redirect()
                ->to(base_url('DetalleEquipos/'.$idEquipo))
                ->with('Exito', 'Fue actualizado correctamente');
        } else {

            $valorModelo->insert([
                'id_equipo' => $idEquipo,
                'id_atributo_equipo' => $idAtributo,
                'valor_atributo' => $valor
            ]);
---
SELECT *
FROM `valor_atributo_equipo`
WHERE `id_equipo` = '52'
AND `id_atributo_equipo` = '37'
 LIMIT 1
INSERT INTO `valor_atributo_equipo` (`id_equipo`, `id_atributo_equipo`, `valor_atributo`) VALUES ('52', '37', '16GB')