app/Models/AtributoEquipoModel.php

    public function atributoPorTipo($id_tipo_equipo)
    {
        return $this->where('id_tipo_equipo', $id_tipo_equipo)->findAll();
---
SELECT *
FROM `atributo_equipo`
WHERE `id_tipo_equipo` = '13'