app/Models/EquipoModel.php

SELECT `e`.`id_equipo` AS `Id`, `e`.`codig_patrimonial` AS `codigoPatrimonial`, `e`.`num_serie` AS `numeroSerie`, `te`.`tipo_equipo` AS `tipoEquipo`, `mae`.`marca_equipo` AS `marcaEquipo`, `me`.`modelo_equipo` AS `modeloEquipo`, `es`.`estado_equipo` AS `estadoEquipo`, `u`.`unidad_organica` AS `unidadActual`, `e`.`id_tipo_equipo`, `e`.`id_modelo_equipo`, `e`.`id_estado_equipo`
FROM `equipo` `e`
JOIN `tipo_equipo` `te` ON `te`.`id_tipo_equipo` = `e`.`id_tipo_equipo`
JOIN `modelo_equipo` `me` ON `me`.`id_modelo_equipo` = `e`.`id_modelo_equipo`
JOIN `marca_equipo` `mae` ON `mae`.`id_marca_equipo` = `me`.`id_marca_equipo`
JOIN `estado_equipo` `es` ON `es`.`id_estado_equipo` = `e`.`id_estado_equipo`
LEFT JOIN `unidad_organica` `u` ON `u`.`id_unidad_organica` = `e`.`unidad_actual`
ORDER BY `e`.`id_equipo` DESC
---
    public function obtenerEquipos()
    {
        return $this->db->table($this->table . ' e')
            ->select('
                e.id_equipo AS Id,
                e.codig_patrimonial AS codigoPatrimonial,
                e.num_serie AS numeroSerie,
                te.tipo_equipo AS tipoEquipo,
                mae.marca_equipo AS marcaEquipo,
                me.modelo_equipo AS modeloEquipo,
                es.estado_equipo AS estadoEquipo,
                u.unidad_organica AS unidadActual,
                e.id_tipo_equipo,
                e.id_modelo_equipo,
                e.id_estado_equipo
            ')
            ->join('tipo_equipo te', 'te.id_tipo_equipo = e.id_tipo_equipo')
            ->join('modelo_equipo me', 'me.id_modelo_equipo = e.id_modelo_equipo')
            ->join('marca_equipo mae', 'mae.id_marca_equipo = me.id_marca_equipo')
            ->join('estado_equipo es', 'es.id_estado_equipo = e.id_estado_equipo')
            ->join('unidad_organica u', 'u.id_unidad_organica = e.unidad_actual', 'left')
            ->orderBy('e.id_equipo', 'DESC')
            ->get()
            ->getResultArray();

SELECT `e`.*, `te`.`tipo_equipo`
FROM `equipo` `e`
JOIN `tipo_equipo` `te` ON `te`.`id_tipo_equipo` = `e`.`id_tipo_equipo`
WHERE `e`.`id_equipo` = '52'
---
    public function obtenerConTipo($id_equipo)
    {
        return $this->db->table($this->table . ' e')
        ->select('e.*, te.tipo_equipo')
        ->join('tipo_equipo te', 'te.id_tipo_equipo = e.id_tipo_equipo')
        ->where('e.id_equipo', $id_equipo)
        ->get()
        ->getRowArray();