app/Models/EquipoModel.php

    public function obtenerJoin()
    {
        return $this->db->table('equipo')
            ->select('
                equipo.id_equipo,
                tipo_equipo.nombre            AS tipo,
                estadoequipo.estado           AS estado,
                modelo.modelo                 AS modelo,
                unidad_organica.nombre        AS unidad
            ')
            ->join('tipo_equipo',      'tipo_equipo.id_tipo = equipo.id_tipoEquipo')
            ->join('estadoequipo',     'estadoequipo.id_estado = equipo.id_estadoEquipo')
            ->join('modelo',           'modelo.id_modelo = equipo.id_modeloEquipo')
            ->join('unidad_organica',  'unidad_organica.id_unidadOrganica = equipo.id_unidadOrganicaEquipo')
            ->get()
            ->getResultArray();
---
SELECT `equipo`.`id_equipo`, `tipo_equipo`.`nombre` AS `tipo`, `estadoequipo`.`estado` AS `estado`, `modelo`.`modelo` AS `modelo`, `unidad_organica`.`nombre` AS `unidad`
FROM `equipo`
JOIN `tipo_equipo` ON `tipo_equipo`.`id_tipo` = `equipo`.`id_tipoEquipo`
JOIN `estadoequipo` ON `estadoequipo`.`id_estado` = `equipo`.`id_estadoEquipo`
JOIN `modelo` ON `modelo`.`id_modelo` = `equipo`.`id_modeloEquipo`
JOIN `unidad_organica` ON `unidad_organica`.`id_unidadOrganica` = `equipo`.`id_unidadOrganicaEquipo`