app/Models/MarcaEquipoModel.php

SELECT `me`.`id_marca_equipo`, `me`.`marca_equipo`
FROM `marca_equipo`, `marca_equipo` `me`
GROUP BY `id_marca_equipo`
ORDER BY `id_marca_equipo` DESC
---
    public function obtenerMarcas()
    {
        return $this->select('me.id_marca_equipo, me.marca_equipo')
                    ->from('marca_equipo me')
                    ->groupBy('id_marca_equipo')
                    ->orderBy('id_marca_equipo', 'DESC')
                    ->findAll();