app/Models/ValatriequipoModel.php

    public function obtenerCaractEquipos($id_equipo)
    {
        return $this->db->table('valor_atributo_equipo vae')
            ->select('
                vae.id_valor_atributo,
                e.codig_patrimonial,
                e.num_serie,
                vae.valor_atributo,
                ae.equipo_atributo
            ')
            ->join('equipo e', 'e.id_equipo = vae.id_equipo')
            ->join('atributo_equipo ae', 'ae.id_atributo_equipo = vae.id_atributo_equipo')
            ->where('e.id_equipo', $id_equipo)
            ->get()
            ->getResultArray();
---
SELECT `vae`.`id_valor_atributo`, `e`.`codig_patrimonial`, `e`.`num_serie`, `vae`.`valor_atributo`, `ae`.`equipo_atributo`
FROM `valor_atributo_equipo` `vae`
JOIN `equipo` `e` ON `e`.`id_equipo` = `vae`.`id_equipo`
JOIN `atributo_equipo` `ae` ON `ae`.`id_atributo_equipo` = `vae`.`id_atributo_equipo`
WHERE `e`.`id_equipo` = '52'